[Survived] ObjectLiteral
src/screens/StatisticsScreen/reducer.ts:9:46
     statisticsIndicator: string;
 };
 
-export const initialState: StatisticsState = {
-    startDate: '',
-    endDate: '',
-    statisticsIndicator: '',
-};
+export const initialState: StatisticsState = {};
 
 export const StatisticsSlice = createSlice({

[Survived] StringLiteral
src/screens/StatisticsScreen/reducer.ts:16:11
 };
 
 export const StatisticsSlice = createSlice({
-    name: 'statistics',
+    name: "",
     initialState,
     reducers: {

[Survived] ObjectLiteral
src/screens/StatisticsScreen/reducer.ts:18:15
 export const StatisticsSlice = createSlice({
     name: 'statistics',
     initialState,
-    reducers: {
-        updateStartDate: (state, { payload }: PayloadAction<string>) => {
-            state.startDate = payload;
-        },
-        updateEndDate: (state, { payload }: PayloadAction<string>) => {
-            state.endDate = payload;
-        },
-        updateStatisticsIndicator: (state, { payload }: PayloadAction<string>) => {
-            state.statisticsIndicator = payload;
-        },
-    },
+    reducers: {},
 });
 

[Survived] BlockStatement
src/screens/StatisticsScreen/reducer.ts:19:73
     name: 'statistics',
     initialState,
     reducers: {
-        updateStartDate: (state, { payload }: PayloadAction<string>) => {
-            state.startDate = payload;
-        },
+        updateStartDate: (state, { payload }: PayloadAction<string>) => {},
         updateEndDate: (state, { payload }: PayloadAction<string>) => {
             state.endDate = payload;

[Survived] BlockStatement
src/screens/StatisticsScreen/reducer.ts:22:71
         updateStartDate: (state, { payload }: PayloadAction<string>) => {
             state.startDate = payload;
         },
-        updateEndDate: (state, { payload }: PayloadAction<string>) => {
-            state.endDate = payload;
-        },
+        updateEndDate: (state, { payload }: PayloadAction<string>) => {},
         updateStatisticsIndicator: (state, { payload }: PayloadAction<string>) => {
             state.statisticsIndicator = payload;

[Survived] BlockStatement
src/screens/StatisticsScreen/reducer.ts:25:83
         updateEndDate: (state, { payload }: PayloadAction<string>) => {
             state.endDate = payload;
         },
-        updateStatisticsIndicator: (state, { payload }: PayloadAction<string>) => {
-            state.statisticsIndicator = payload;
-        },
+        updateStatisticsIndicator: (state, { payload }: PayloadAction<string>) => {},
     },
 });
