[Survived] BooleanLiteral
src/screens/TariffsScreen/reducer.ts:17:21
         title: '2,5р/мин',
         cost: 2.5,
         maxCost: 600,
-        isDuration: true,
+        isDuration: false,
     },
     {

[Survived] ObjectLiteral
src/screens/TariffsScreen/reducer.ts:19:5
         maxCost: 600,
         isDuration: true,
     },
-    {
-        id: 2,
-        title: 'Ночефка без буфета',
-        cost: 0,
-        maxCost: 400,
-        isDuration: false,
-    },
+    {},
     {
         id: 3,

[Survived] BooleanLiteral
src/screens/TariffsScreen/reducer.ts:24:21
         title: 'Ночефка без буфета',
         cost: 0,
         maxCost: 400,
-        isDuration: false,
+        isDuration: true,
     },
     {

[Survived] BooleanLiteral
src/screens/TariffsScreen/reducer.ts:31:21
         title: 'Ночефка с буфетом',
         cost: 0,
         maxCost: 600,
-        isDuration: false,
+        isDuration: true,
     },
     {

[Survived] BooleanLiteral
src/screens/TariffsScreen/reducer.ts:38:21
         title: 'OneGame',
         cost: 0,
         maxCost: 100,
-        isDuration: false,
+        isDuration: true,
     },
 ];

[Survived] BlockStatement
src/screens/TariffsScreen/reducer.ts:47:42
     initialState,
     reducers: {
         add: {
-            prepare: (tariff: Tariff) => {
-                tariff.id = Date.now();
-                return { payload: tariff };
-            },
+            prepare: (tariff: Tariff) => {},
             reducer: (state, { payload }: PayloadAction<Tariff>) => {
                 state.push(payload);

[Survived] BlockStatement
src/screens/TariffsScreen/reducer.ts:51:69
                 tariff.id = Date.now();
                 return { payload: tariff };
             },
-            reducer: (state, { payload }: PayloadAction<Tariff>) => {
-                state.push(payload);
-            },
+            reducer: (state, { payload }: PayloadAction<Tariff>) => {},
         },
         edit: (state, { payload }: PayloadAction<Tariff>) => {

[Survived] BlockStatement
src/screens/TariffsScreen/reducer.ts:55:62
                 state.push(payload);
             },
         },
-        edit: (state, { payload }: PayloadAction<Tariff>) => {
-            const indexTariff = state.findIndex((tariff) => tariff.id === payload.id);
-            state[indexTariff] = payload;
-        },
+        edit: (state, { payload }: PayloadAction<Tariff>) => {},
         delete: (state, { payload }: PayloadAction<Tariff>) => {
             return state.filter((tariff) => tariff.id !== payload.id);

[Survived] ArrowFunction
src/screens/TariffsScreen/reducer.ts:56:49
             },
         },
         edit: (state, { payload }: PayloadAction<Tariff>) => {
-            const indexTariff = state.findIndex((tariff) => tariff.id === payload.id);
+            const indexTariff = state.findIndex(() => undefined);
             state[indexTariff] = payload;
         },

[Survived] ConditionalExpression
src/screens/TariffsScreen/reducer.ts:56:61
             },
         },
         edit: (state, { payload }: PayloadAction<Tariff>) => {
-            const indexTariff = state.findIndex((tariff) => tariff.id === payload.id);
+            const indexTariff = state.findIndex((tariff) => true);
             state[indexTariff] = payload;
         },

[Survived] BlockStatement
src/screens/TariffsScreen/reducer.ts:59:64
             const indexTariff = state.findIndex((tariff) => tariff.id === payload.id);
             state[indexTariff] = payload;
         },
-        delete: (state, { payload }: PayloadAction<Tariff>) => {
-            return state.filter((tariff) => tariff.id !== payload.id);
-        },
+        delete: (state, { payload }: PayloadAction<Tariff>) => {},
     },
 });

[Survived] ArrowFunction
src/screens/TariffsScreen/reducer.ts:60:33
             state[indexTariff] = payload;
         },
         delete: (state, { payload }: PayloadAction<Tariff>) => {
-            return state.filter((tariff) => tariff.id !== payload.id);
+            return state.filter(() => undefined);
         },
     },

[Survived] ConditionalExpression
src/screens/TariffsScreen/reducer.ts:60:45
             state[indexTariff] = payload;
         },
         delete: (state, { payload }: PayloadAction<Tariff>) => {
-            return state.filter((tariff) => tariff.id !== payload.id);
+            return state.filter((tariff) => true);
         },
     },
