[Survived] ArrayDeclaration
src/screens/VisitorsScreen/reducer.ts:45:20
             name: 'Франц',
             tariffId: 1,
             status: Status.finished,
-            times: [
-                { timestamp: 1597833600000, status: Status.active },
-                { timestamp: 1597847340000, status: Status.finished },
-            ],
+            times: [],
         },
     ],

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:46:17
             tariffId: 1,
             status: Status.finished,
             times: [
-                { timestamp: 1597833600000, status: Status.active },
+                {},
                 { timestamp: 1597847340000, status: Status.finished },
             ],

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:52:9
         },
     ],
     historyVisitors: [
-        {
-            id: 1,
-            name: 'Франц',
-            tariffId: 1,
-            status: Status.finished,
-            times: [
-                { timestamp: 1597833600000, status: Status.active },
-                { timestamp: 1597847340000, status: Status.finished },
-            ],
-        },
+        {},
         {
             id: 2,

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:59:17
             status: Status.finished,
             times: [
                 { timestamp: 1597833600000, status: Status.active },
-                { timestamp: 1597847340000, status: Status.finished },
+                {},
             ],
         },

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:62:9
                 { timestamp: 1597847340000, status: Status.finished },
             ],
         },
-        {
-            id: 2,
-            name: 'Франц 2',
-            tariffId: 2,
-            status: Status.finished,
-            times: [
-                { timestamp: 1597836180000, status: Status.active },
-                { timestamp: 1597847340000, status: Status.finished },
-            ],
-        },
+        {},
         {
             id: 3,

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:79:17
             status: Status.finished,
             times: [
                 { timestamp: 1597924800000, status: Status.active },
-                { timestamp: 1597938000000, status: Status.finished },
+                {},
             ],
         },

[Survived] ArrayDeclaration
src/screens/VisitorsScreen/reducer.ts:97:20
             name: 'Франц 5',
             tariffId: 4,
             status: Status.finished,
-            times: [
-                { timestamp: 1598098200000, status: Status.active },
-                { timestamp: 1598120400000, status: Status.finished },
-            ],
+            times: [],
         },
         {

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:99:17
             status: Status.finished,
             times: [
                 { timestamp: 1598098200000, status: Status.active },
-                { timestamp: 1598120400000, status: Status.finished },
+                {},
             ],
         },

[Survived] StringLiteral
src/screens/VisitorsScreen/reducer.ts:104:19
         },
         {
             id: 6,
-            name: 'Франц 6',
+            name: "",
             tariffId: 1,
             status: Status.finished,

[Survived] BooleanLiteral
src/screens/VisitorsScreen/reducer.ts:124:22
         },
     ],
     modals: {
-        payVisitors: false,
+        payVisitors: true,
         historyVisitors: false,
     },

[Survived] BooleanLiteral
src/screens/VisitorsScreen/reducer.ts:125:26
     ],
     modals: {
         payVisitors: false,
-        historyVisitors: false,
+        historyVisitors: true,
     },
     total: 0,

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:137:44
     initialState,
     reducers: {
         add: {
-            prepare: (visitor: Visitor) => {
-                const newTime = Date.now();
-                visitor.id = newTime;
-                visitor.status = Status.active;
-                visitor.times = [{ timestamp: newTime, status: Status.active }];
-                return { payload: visitor };
-            },
+            prepare: (visitor: Visitor) => {},
             reducer: (state, { payload }: PayloadAction<Visitor>) => {
                 state.visitors.push(payload);

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:141:34
                 const newTime = Date.now();
                 visitor.id = newTime;
                 visitor.status = Status.active;
-                visitor.times = [{ timestamp: newTime, status: Status.active }];
+                visitor.times = [{}];
                 return { payload: visitor };
             },

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:142:24
                 visitor.id = newTime;
                 visitor.status = Status.active;
                 visitor.times = [{ timestamp: newTime, status: Status.active }];
-                return { payload: visitor };
+                return {};
             },
             reducer: (state, { payload }: PayloadAction<Visitor>) => {

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:144:70
                 visitor.times = [{ timestamp: newTime, status: Status.active }];
                 return { payload: visitor };
             },
-            reducer: (state, { payload }: PayloadAction<Visitor>) => {
-                state.visitors.push(payload);
-            },
+            reducer: (state, { payload }: PayloadAction<Visitor>) => {},
         },
         edit: (state, { payload }: PayloadAction<Visitor>) => {

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:148:63
                 state.visitors.push(payload);
             },
         },
-        edit: (state, { payload }: PayloadAction<Visitor>) => {
-            const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
-            state.visitors[indexVisitor] = payload;
-        },
+        edit: (state, { payload }: PayloadAction<Visitor>) => {},
         delete: (state, { payload }: PayloadAction<Visitor>) => {
             state.visitors = state.visitors.filter((visitor) => visitor.id !== payload.id);

[Survived] ConditionalExpression
src/screens/VisitorsScreen/reducer.ts:149:72
             },
         },
         edit: (state, { payload }: PayloadAction<Visitor>) => {
-            const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
+            const indexVisitor = state.visitors.findIndex((visitor) => false);
             state.visitors[indexVisitor] = payload;
         },

[Survived] ArrowFunction
src/screens/VisitorsScreen/reducer.ts:149:59
             },
         },
         edit: (state, { payload }: PayloadAction<Visitor>) => {
-            const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
+            const indexVisitor = state.visitors.findIndex(() => undefined);
             state.visitors[indexVisitor] = payload;
         },

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:152:65
             const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
             state.visitors[indexVisitor] = payload;
         },
-        delete: (state, { payload }: PayloadAction<Visitor>) => {
-            state.visitors = state.visitors.filter((visitor) => visitor.id !== payload.id);
-        },
+        delete: (state, { payload }: PayloadAction<Visitor>) => {},
         event: (state, { payload }: PayloadAction<EventUser>) => {
             const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);

[Survived] ArrowFunction
src/screens/VisitorsScreen/reducer.ts:153:52
             state.visitors[indexVisitor] = payload;
         },
         delete: (state, { payload }: PayloadAction<Visitor>) => {
-            state.visitors = state.visitors.filter((visitor) => visitor.id !== payload.id);
+            state.visitors = state.visitors.filter(() => undefined);
         },
         event: (state, { payload }: PayloadAction<EventUser>) => {

[Survived] ConditionalExpression
src/screens/VisitorsScreen/reducer.ts:153:65
             state.visitors[indexVisitor] = payload;
         },
         delete: (state, { payload }: PayloadAction<Visitor>) => {
-            state.visitors = state.visitors.filter((visitor) => visitor.id !== payload.id);
+            state.visitors = state.visitors.filter((visitor) => false);
         },
         event: (state, { payload }: PayloadAction<EventUser>) => {

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:155:66
         delete: (state, { payload }: PayloadAction<Visitor>) => {
             state.visitors = state.visitors.filter((visitor) => visitor.id !== payload.id);
         },
-        event: (state, { payload }: PayloadAction<EventUser>) => {
-            const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
-            state.visitors[indexVisitor].status = payload.status;
-            state.visitors[indexVisitor].times.push({
-                timestamp: payload.timestamp,
-                status: payload.status,
-            });
-        },
+        event: (state, { payload }: PayloadAction<EventUser>) => {},
         selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {
             for (let i = 0; i < payload.length; i++) {

[Survived] EqualityOperator
src/screens/VisitorsScreen/reducer.ts:156:83
             state.visitors = state.visitors.filter((visitor) => visitor.id !== payload.id);
         },
         event: (state, { payload }: PayloadAction<EventUser>) => {
-            const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
+            const indexVisitor = state.visitors.findIndex((visitor) => visitor.id !== payload.id);
             state.visitors[indexVisitor].status = payload.status;
             state.visitors[indexVisitor].times.push({

[Survived] ConditionalExpression
src/screens/VisitorsScreen/reducer.ts:156:72
             state.visitors = state.visitors.filter((visitor) => visitor.id !== payload.id);
         },
         event: (state, { payload }: PayloadAction<EventUser>) => {
-            const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
+            const indexVisitor = state.visitors.findIndex((visitor) => true);
             state.visitors[indexVisitor].status = payload.status;
             state.visitors[indexVisitor].times.push({

[Survived] ObjectLiteral
src/screens/VisitorsScreen/reducer.ts:158:53
         event: (state, { payload }: PayloadAction<EventUser>) => {
             const indexVisitor = state.visitors.findIndex((visitor) => visitor.id === payload.id);
             state.visitors[indexVisitor].status = payload.status;
-            state.visitors[indexVisitor].times.push({
-                timestamp: payload.timestamp,
-                status: payload.status,
-            });
+            state.visitors[indexVisitor].times.push({});
         },
         selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:163:75
                 status: payload.status,
             });
         },
-        selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {
-            for (let i = 0; i < payload.length; i++) {
-                state.visitors = state.visitors.filter((visitor) => visitor.id !== payload[i].id);
-            }
-        },
+        selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {},
         selectedPay: (state, { payload }: PayloadAction<VisitorsWithTimestamp>) => {
             for (let i = 0; i < payload.visitors.length; i++) {

[Survived] ConditionalExpression
src/screens/VisitorsScreen/reducer.ts:164:29
             });
         },
         selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {
-            for (let i = 0; i < payload.length; i++) {
+            for (let i = 0; false; i++) {
                 state.visitors = state.visitors.filter((visitor) => visitor.id !== payload[i].id);
             }

[Survived] UpdateOperator
src/screens/VisitorsScreen/reducer.ts:164:49
             });
         },
         selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {
-            for (let i = 0; i < payload.length; i++) {
+            for (let i = 0; i < payload.length; i--) {
                 state.visitors = state.visitors.filter((visitor) => visitor.id !== payload[i].id);
             }

[Survived] ConditionalExpression
src/screens/VisitorsScreen/reducer.ts:165:69
         },
         selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {
             for (let i = 0; i < payload.length; i++) {
-                state.visitors = state.visitors.filter((visitor) => visitor.id !== payload[i].id);
+                state.visitors = state.visitors.filter((visitor) => false);
             }
         },

[Survived] ArrowFunction
src/screens/VisitorsScreen/reducer.ts:165:56
         },
         selectedDelete: (state, { payload }: PayloadAction<Visitor[]>) => {
             for (let i = 0; i < payload.length; i++) {
-                state.visitors = state.visitors.filter((visitor) => visitor.id !== payload[i].id);
+                state.visitors = state.visitors.filter(() => undefined);
             }
         },

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:168:84
                 state.visitors = state.visitors.filter((visitor) => visitor.id !== payload[i].id);
             }
         },
-        selectedPay: (state, { payload }: PayloadAction<VisitorsWithTimestamp>) => {
-            for (let i = 0; i < payload.visitors.length; i++) {
-                const indexVisitor = state.visitors.findIndex(
-                    (visitor) => visitor.id === payload.visitors[i].id,
-                );
-                state.visitors[indexVisitor].status = Status.finished;
-                state.visitors[indexVisitor].times.push({
-                    timestamp: payload.timestamp,
-                    status: Status.finished,
-                });
-            }
-            state.total = 0;
-            state.payedVisitors = [];
-        },
+        selectedPay: (state, { payload }: PayloadAction<VisitorsWithTimestamp>) => {},
         modalPayToggle: (state, { payload }: PayloadAction<boolean>) => {
             state.modals.payVisitors = payload;

[Survived] EqualityOperator
src/screens/VisitorsScreen/reducer.ts:169:31
             }
         },
         selectedPay: (state, { payload }: PayloadAction<VisitorsWithTimestamp>) => {
-            for (let i = 0; i < payload.visitors.length; i++) {
+            for (let i = 0; i >= payload.visitors.length; i++) {
                 const indexVisitor = state.visitors.findIndex(
                     (visitor) => visitor.id === payload.visitors[i].id,

[Survived] UpdateOperator
src/screens/VisitorsScreen/reducer.ts:169:58
             }
         },
         selectedPay: (state, { payload }: PayloadAction<VisitorsWithTimestamp>) => {
-            for (let i = 0; i < payload.visitors.length; i++) {
+            for (let i = 0; i < payload.visitors.length; i--) {
                 const indexVisitor = state.visitors.findIndex(
                     (visitor) => visitor.id === payload.visitors[i].id,

[Survived] EqualityOperator
src/screens/VisitorsScreen/reducer.ts:171:45
         selectedPay: (state, { payload }: PayloadAction<VisitorsWithTimestamp>) => {
             for (let i = 0; i < payload.visitors.length; i++) {
                 const indexVisitor = state.visitors.findIndex(
-                    (visitor) => visitor.id === payload.visitors[i].id,
+                    (visitor) => visitor.id !== payload.visitors[i].id,
                 );
                 state.visitors[indexVisitor].status = Status.finished;

[Survived] ConditionalExpression
src/screens/VisitorsScreen/reducer.ts:171:34
         selectedPay: (state, { payload }: PayloadAction<VisitorsWithTimestamp>) => {
             for (let i = 0; i < payload.visitors.length; i++) {
                 const indexVisitor = state.visitors.findIndex(
-                    (visitor) => visitor.id === payload.visitors[i].id,
+                    (visitor) => true,
                 );
                 state.visitors[indexVisitor].status = Status.finished;

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:182:73
             state.total = 0;
             state.payedVisitors = [];
         },
-        modalPayToggle: (state, { payload }: PayloadAction<boolean>) => {
-            state.modals.payVisitors = payload;
-        },
+        modalPayToggle: (state, { payload }: PayloadAction<boolean>) => {},
         modalHistoryToggle: (state, { payload }: PayloadAction<boolean>) => {
             state.modals.historyVisitors = payload;

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:185:77
         modalPayToggle: (state, { payload }: PayloadAction<boolean>) => {
             state.modals.payVisitors = payload;
         },
-        modalHistoryToggle: (state, { payload }: PayloadAction<boolean>) => {
-            state.modals.historyVisitors = payload;
-        },
+        modalHistoryToggle: (state, { payload }: PayloadAction<boolean>) => {},
         totalCalculate: (state, { payload }: PayloadAction<number>) => {
             state.total = payload;

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:188:72
         modalHistoryToggle: (state, { payload }: PayloadAction<boolean>) => {
             state.modals.historyVisitors = payload;
         },
-        totalCalculate: (state, { payload }: PayloadAction<number>) => {
-            state.total = payload;
-        },
+        totalCalculate: (state, { payload }: PayloadAction<number>) => {},
         payedVisitorsSet: (state, { payload }: PayloadAction<Visitor[]>) => {
             state.payedVisitors = payload;

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:191:77
         totalCalculate: (state, { payload }: PayloadAction<number>) => {
             state.total = payload;
         },
-        payedVisitorsSet: (state, { payload }: PayloadAction<Visitor[]>) => {
-            state.payedVisitors = payload;
-        },
+        payedVisitorsSet: (state, { payload }: PayloadAction<Visitor[]>) => {},
         timerUpdate: (state, { payload }: PayloadAction<number>) => {
             state.timer = payload;

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:194:69
         payedVisitorsSet: (state, { payload }: PayloadAction<Visitor[]>) => {
             state.payedVisitors = payload;
         },
-        timerUpdate: (state, { payload }: PayloadAction<number>) => {
-            state.timer = payload;
-        },
+        timerUpdate: (state, { payload }: PayloadAction<number>) => {},
         historyPut: (state) => {
             Array.prototype.push.apply(state.historyVisitors, state.visitors);

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:197:32
         timerUpdate: (state, { payload }: PayloadAction<number>) => {
             state.timer = payload;
         },
-        historyPut: (state) => {
-            Array.prototype.push.apply(state.historyVisitors, state.visitors);
-            state.visitors = [];
-        },
+        historyPut: (state) => {},
         historyClean: (state) => {
             state.historyVisitors = [];

[Survived] ArrayDeclaration
src/screens/VisitorsScreen/reducer.ts:199:30
         },
         historyPut: (state) => {
             Array.prototype.push.apply(state.historyVisitors, state.visitors);
-            state.visitors = [];
+            state.visitors = ["Stryker was here"];
         },
         historyClean: (state) => {

[Survived] BlockStatement
src/screens/VisitorsScreen/reducer.ts:201:34
             Array.prototype.push.apply(state.historyVisitors, state.visitors);
             state.visitors = [];
         },
-        historyClean: (state) => {
-            state.historyVisitors = [];
-        },
+        historyClean: (state) => {},
     },
 });
