[Survived] ObjectLiteral
Web Projects/Frontier/src/store.ts:24:33
     Tariff,
 } from '@/screens';
 
-const reducer = combineReducers({
-    visitors: VisitorsSlice.reducer,
-    tariffs: TariffsSlice.reducer,
-    statistics: StatisticsSlice.reducer,
-});
+const reducer = combineReducers({});
 const persistConfig = {
     key: 'root',

[Survived] ObjectLiteral
Web Projects/Frontier/src/store.ts:29:23
     tariffs: TariffsSlice.reducer,
     statistics: StatisticsSlice.reducer,
 });
-const persistConfig = {
-    key: 'root',
-    storage: storage('myDB'),
-};
+const persistConfig = {};
 const persistedReducer = persistReducer(persistConfig, reducer);
 

[Survived] StringLiteral
Web Projects/Frontier/src/store.ts:31:22
 });
 const persistConfig = {
     key: 'root',
-    storage: storage('myDB'),
+    storage: storage(""),
 };
 const persistedReducer = persistReducer(persistConfig, reducer);

[Survived] BlockStatement
Web Projects/Frontier/src/store.ts:40:34
     tariffs: Tariff[];
     statistics: StatisticsState;
 };
-export const createStore = () => {
-    return configureStore({
-        reducer: persistedReducer,
-        middleware: getDefaultMiddleware({
-            serializableCheck: {
-                ignoredActions: [FLUSH, REHYDRATE, PAUSE, PERSIST, PURGE, REGISTER],
-            },
-        }),
-        devTools: process.env.NODE_ENV !== 'production',
-    });
-};
+export const createStore = () => {};
 export const store = createStore();
 export const persistor = persistStore(store);

[Survived] EqualityOperator
Web Projects/Frontier/src/store.ts:48:40
                 ignoredActions: [FLUSH, REHYDRATE, PAUSE, PERSIST, PURGE, REGISTER],
             },
         }),
-        devTools: process.env.NODE_ENV !== 'production',
+        devTools: process.env.NODE_ENV === 'production',
     });
 };

[Survived] ConditionalExpression
Web Projects/Frontier/src/store.ts:48:19
                 ignoredActions: [FLUSH, REHYDRATE, PAUSE, PERSIST, PURGE, REGISTER],
             },
         }),
-        devTools: process.env.NODE_ENV !== 'production',
+        devTools: true,
     });
 };
