[Survived] BlockStatement
Frontier/src/utils/FormatDate.ts:1:65
-export const timestampToString = (timestamp: number): string => {
-    return new Date(timestamp).toLocaleDateString().split('.').reverse().join('-');
-};
+export const timestampToString = (timestamp: number): string => {};
 export const stringToTimestamp = (date: string): number => {
     return new Date(date).getTime();

[Survived] BlockStatement
Frontier/src/utils/FormatDate.ts:4:60
 export const timestampToString = (timestamp: number): string => {
     return new Date(timestamp).toLocaleDateString().split('.').reverse().join('-');
 };
-export const stringToTimestamp = (date: string): number => {
-    return new Date(date).getTime();
-};
+export const stringToTimestamp = (date: string): number => {};
 
