[Survived] BlockStatement
Frontier/src/utils/calculateCost.ts:6:14
     maxCost: number,
     duration: number,
     isDuration: boolean,
-): number => {
-    const value = cost * duration;
-    return isDuration && value < maxCost ? value : maxCost;
-};
+): number => {};
 

[Survived] ArithmeticOperator
Frontier/src/utils/calculateCost.ts:7:24
     duration: number,
     isDuration: boolean,
 ): number => {
-    const value = cost * duration;
+    const value = cost / duration;
     return isDuration && value < maxCost ? value : maxCost;
 };

[Survived] ConditionalExpression
Frontier/src/utils/calculateCost.ts:8:12
     isDuration: boolean,
 ): number => {
     const value = cost * duration;
-    return isDuration && value < maxCost ? value : maxCost;
+    return false ? value : maxCost;
 };
 

[Survived] ConditionalExpression
Frontier/src/utils/calculateCost.ts:8:26
     isDuration: boolean,
 ): number => {
     const value = cost * duration;
-    return isDuration && value < maxCost ? value : maxCost;
+    return isDuration && false ? value : maxCost;
 };
 
