[Survived] BlockStatement
Frontier/src/utils/calculateCostHelper.ts:5:91
 import { calculateCost } from '@/utils/calculateCost';
 import { calculateDuration } from '@/utils/calculateDuration';
 
-export const calculateCostHelper = (data: Visitor | Visitor[], tariffs: Array<Tariff>) => {
-    data = Array.isArray(data) ? data : [data];
-    let total = 0;
-    for (let i = 0; i < data.length; i++) {
-        const tariffId = +data[i].tariffId;
-        const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
-        const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
-        const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
-            .isDuration;
-        total += calculateCost(
-            tariffCost,
-            tariffMaxCost,
-            calculateDuration(data[i].times),
-            tariffIsDuration,
-        );
-    }
-    return total;
-};
+export const calculateCostHelper = (data: Visitor | Visitor[], tariffs: Array<Tariff>) => {};
 

[Survived] EqualityOperator
Frontier/src/utils/calculateCostHelper.ts:8:23
 export const calculateCostHelper = (data: Visitor | Visitor[], tariffs: Array<Tariff>) => {
     data = Array.isArray(data) ? data : [data];
     let total = 0;
-    for (let i = 0; i < data.length; i++) {
+    for (let i = 0; i <= data.length; i++) {
         const tariffId = +data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;

[Survived] UpdateOperator
Frontier/src/utils/calculateCostHelper.ts:8:38
 export const calculateCostHelper = (data: Visitor | Visitor[], tariffs: Array<Tariff>) => {
     data = Array.isArray(data) ? data : [data];
     let total = 0;
-    for (let i = 0; i < data.length; i++) {
+    for (let i = 0; i < data.length; i--) {
         const tariffId = +data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;

[Survived] UnaryOperator
Frontier/src/utils/calculateCostHelper.ts:9:26
     data = Array.isArray(data) ? data : [data];
     let total = 0;
     for (let i = 0; i < data.length; i++) {
-        const tariffId = +data[i].tariffId;
+        const tariffId = -data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;

[Survived] EqualityOperator
Frontier/src/utils/calculateCostHelper.ts:10:67
     let total = 0;
     for (let i = 0; i < data.length; i++) {
         const tariffId = +data[i].tariffId;
-        const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
+        const tariffMaxCost = (tariffs.find((tariff) => tariff.id !== tariffId) as Tariff).maxCost;
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)

[Survived] ConditionalExpression
Frontier/src/utils/calculateCostHelper.ts:10:57
     let total = 0;
     for (let i = 0; i < data.length; i++) {
         const tariffId = +data[i].tariffId;
-        const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
+        const tariffMaxCost = (tariffs.find((tariff) => true) as Tariff).maxCost;
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)

[Survived] ConditionalExpression
Frontier/src/utils/calculateCostHelper.ts:11:54
     for (let i = 0; i < data.length; i++) {
         const tariffId = +data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
-        const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
+        const tariffCost = (tariffs.find((tariff) => true) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
             .isDuration;

[Survived] ArrowFunction
Frontier/src/utils/calculateCostHelper.ts:11:42
     for (let i = 0; i < data.length; i++) {
         const tariffId = +data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
-        const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
+        const tariffCost = (tariffs.find(() => undefined) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
             .isDuration;

[Survived] ConditionalExpression
Frontier/src/utils/calculateCostHelper.ts:12:60
         const tariffId = +data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
-        const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
+        const tariffIsDuration = (tariffs.find((tariff) => false) as Tariff)
             .isDuration;
         total += calculateCost(

[Survived] ConditionalExpression
Frontier/src/utils/calculateCostHelper.ts:12:60
         const tariffId = +data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
-        const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
+        const tariffIsDuration = (tariffs.find((tariff) => true) as Tariff)
             .isDuration;
         total += calculateCost(

[Survived] ConditionalExpression
Frontier/src/utils/calculateCostHelper.ts:14:9
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
             .isDuration;
-        total += calculateCost(
-            tariffCost,
-            tariffMaxCost,
-            calculateDuration(data[i].times),
-            tariffIsDuration,
-        );
+        true;
     }
     return total;

[Survived] ConditionalExpression
Frontier/src/utils/calculateCostHelper.ts:14:9
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
             .isDuration;
-        total += calculateCost(
-            tariffCost,
-            tariffMaxCost,
-            calculateDuration(data[i].times),
-            tariffIsDuration,
-        );
+        false;
     }
     return total;
