[Survived] BlockStatement
Frontier/src/utils/calculateDuration.ts:3:67
 import { Event, Status } from '@/screens';
 
-export const calculateDuration = (times: Array<Event>): number => {
-    let time = 0;
-    let startMark = 0;
-    for (let i = 0; i < times.length; i++) {
-        if (times[i].status === Status.active) {
-            startMark = times[i].timestamp;
-        } else {
-            time += times[i].timestamp - startMark;
-            startMark = 0;
-        }
-    }
-    if (times[times.length - 1].status === Status.active) {
-        time += Date.now() - startMark;
-    }
-    return Math.floor(time / 60000);
-};
+export const calculateDuration = (times: Array<Event>): number => {};
 

[Survived] UpdateOperator
Frontier/src/utils/calculateDuration.ts:6:39
 export const calculateDuration = (times: Array<Event>): number => {
     let time = 0;
     let startMark = 0;
-    for (let i = 0; i < times.length; i++) {
+    for (let i = 0; i < times.length; i--) {
         if (times[i].status === Status.active) {
             startMark = times[i].timestamp;

[Survived] ConditionalExpression
Frontier/src/utils/calculateDuration.ts:6:21
 export const calculateDuration = (times: Array<Event>): number => {
     let time = 0;
     let startMark = 0;
-    for (let i = 0; i < times.length; i++) {
+    for (let i = 0; false; i++) {
         if (times[i].status === Status.active) {
             startMark = times[i].timestamp;

[Survived] BlockStatement
Frontier/src/utils/calculateDuration.ts:7:48
     let time = 0;
     let startMark = 0;
     for (let i = 0; i < times.length; i++) {
-        if (times[i].status === Status.active) {
-            startMark = times[i].timestamp;
-        } else {
+        if (times[i].status === Status.active) {} else {
             time += times[i].timestamp - startMark;
             startMark = 0;

[Survived] EqualityOperator
Frontier/src/utils/calculateDuration.ts:7:29
     let time = 0;
     let startMark = 0;
     for (let i = 0; i < times.length; i++) {
-        if (times[i].status === Status.active) {
+        if (times[i].status !== Status.active) {
             startMark = times[i].timestamp;
         } else {

[Survived] BlockStatement
Frontier/src/utils/calculateDuration.ts:9:16
     for (let i = 0; i < times.length; i++) {
         if (times[i].status === Status.active) {
             startMark = times[i].timestamp;
-        } else {
-            time += times[i].timestamp - startMark;
-            startMark = 0;
-        }
+        } else {}
     }
     if (times[times.length - 1].status === Status.active) {

[Survived] ConditionalExpression
Frontier/src/utils/calculateDuration.ts:10:13
         if (times[i].status === Status.active) {
             startMark = times[i].timestamp;
         } else {
-            time += times[i].timestamp - startMark;
+            true;
             startMark = 0;
         }

[Survived] ArithmeticOperator
Frontier/src/utils/calculateDuration.ts:10:40
         if (times[i].status === Status.active) {
             startMark = times[i].timestamp;
         } else {
-            time += times[i].timestamp - startMark;
+            time += times[i].timestamp + startMark;
             startMark = 0;
         }

[Survived] BlockStatement
Frontier/src/utils/calculateDuration.ts:14:59
             startMark = 0;
         }
     }
-    if (times[times.length - 1].status === Status.active) {
-        time += Date.now() - startMark;
-    }
+    if (times[times.length - 1].status === Status.active) {}
     return Math.floor(time / 60000);
 };

[Survived] ConditionalExpression
Frontier/src/utils/calculateDuration.ts:14:9
             startMark = 0;
         }
     }
-    if (times[times.length - 1].status === Status.active) {
+    if (true) {
         time += Date.now() - startMark;
     }

[Survived] ArithmeticOperator
Frontier/src/utils/calculateDuration.ts:15:28
         }
     }
     if (times[times.length - 1].status === Status.active) {
-        time += Date.now() - startMark;
+        time += Date.now() + startMark;
     }
     return Math.floor(time / 60000);

[Survived] ConditionalExpression
Frontier/src/utils/calculateDuration.ts:15:9
         }
     }
     if (times[times.length - 1].status === Status.active) {
-        time += Date.now() - startMark;
+        false;
     }
     return Math.floor(time / 60000);

[Survived] ArithmeticOperator
Frontier/src/utils/calculateDuration.ts:17:28
     if (times[times.length - 1].status === Status.active) {
         time += Date.now() - startMark;
     }
-    return Math.floor(time / 60000);
+    return Math.floor(time * 60000);
 };
 
