[Survived] ArithmeticOperator
Frontier/src/utils/initialTheme.ts:12:41
             display: 'flex',
         },
         appBar: {
-            zIndex: theme.zIndex.drawer + 1,
+            zIndex: theme.zIndex.drawer - 1,
             transition: theme.transitions.create(['width', 'margin'], {
                 easing: theme.transitions.easing.sharp,

[Survived] ArrayDeclaration
Frontier/src/utils/initialTheme.ts:13:50
         },
         appBar: {
             zIndex: theme.zIndex.drawer + 1,
-            transition: theme.transitions.create(['width', 'margin'], {
+            transition: theme.transitions.create([], {
                 easing: theme.transitions.easing.sharp,
                 duration: theme.transitions.duration.leavingScreen,

[Survived] ObjectLiteral
Frontier/src/utils/initialTheme.ts:18:22
                 duration: theme.transitions.duration.leavingScreen,
             }),
         },
-        appBarShift: {
-            marginLeft: drawerWidth,
-            width: `calc(100% - ${drawerWidth}px)`,
-            transition: theme.transitions.create(['width', 'margin'], {
-                easing: theme.transitions.easing.sharp,
-                duration: theme.transitions.duration.enteringScreen,
-            }),
-        },
+        appBarShift: {},
         menuButton: {
             marginRight: 36,

[Survived] StringLiteral
Frontier/src/utils/initialTheme.ts:21:60
         appBarShift: {
             marginLeft: drawerWidth,
             width: `calc(100% - ${drawerWidth}px)`,
-            transition: theme.transitions.create(['width', 'margin'], {
+            transition: theme.transitions.create(['width', ""], {
                 easing: theme.transitions.easing.sharp,
                 duration: theme.transitions.duration.enteringScreen,

[Survived] ArrayDeclaration
Frontier/src/utils/initialTheme.ts:21:50
         appBarShift: {
             marginLeft: drawerWidth,
             width: `calc(100% - ${drawerWidth}px)`,
-            transition: theme.transitions.create(['width', 'margin'], {
+            transition: theme.transitions.create([], {
                 easing: theme.transitions.easing.sharp,
                 duration: theme.transitions.duration.enteringScreen,

[Survived] ObjectLiteral
Frontier/src/utils/initialTheme.ts:26:21
                 duration: theme.transitions.duration.enteringScreen,
             }),
         },
-        menuButton: {
-            marginRight: 36,
-        },
+        menuButton: {},
         hide: {
             display: 'none',

[Survived] ObjectLiteral
Frontier/src/utils/initialTheme.ts:29:15
         menuButton: {
             marginRight: 36,
         },
-        hide: {
-            display: 'none',
-        },
+        hide: {},
         drawer: {
             width: drawerWidth,

[Survived] StringLiteral
Frontier/src/utils/initialTheme.ts:35:25
         drawer: {
             width: drawerWidth,
             flexShrink: 0,
-            whiteSpace: 'nowrap',
+            whiteSpace: "",
         },
         drawerOpen: {

[Survived] ObjectLiteral
Frontier/src/utils/initialTheme.ts:39:59
         },
         drawerOpen: {
             width: drawerWidth,
-            transition: theme.transitions.create('width', {
-                easing: theme.transitions.easing.sharp,
-                duration: theme.transitions.duration.enteringScreen,
-            }),
+            transition: theme.transitions.create('width', {}),
         },
         drawerClose: {

[Survived] StringLiteral
Frontier/src/utils/initialTheme.ts:39:50
         },
         drawerOpen: {
             width: drawerWidth,
-            transition: theme.transitions.create('width', {
+            transition: theme.transitions.create("", {
                 easing: theme.transitions.easing.sharp,
                 duration: theme.transitions.duration.enteringScreen,

[Survived] ArithmeticOperator
Frontier/src/utils/initialTheme.ts:50:37
                 duration: theme.transitions.duration.leavingScreen,
             }),
             overflowX: 'hidden',
-            width: theme.spacing(7) + 1,
+            width: theme.spacing(7) - 1,
             [theme.breakpoints.up('sm')]: {
                 width: theme.spacing(9) + 1,

[Survived] ObjectLiteral
Frontier/src/utils/initialTheme.ts:51:43
             }),
             overflowX: 'hidden',
             width: theme.spacing(7) + 1,
-            [theme.breakpoints.up('sm')]: {
-                width: theme.spacing(9) + 1,
-            },
+            [theme.breakpoints.up('sm')]: {},
         },
         toolbar: {

[Survived] ArithmeticOperator
Frontier/src/utils/initialTheme.ts:52:41
             overflowX: 'hidden',
             width: theme.spacing(7) + 1,
             [theme.breakpoints.up('sm')]: {
-                width: theme.spacing(9) + 1,
+                width: theme.spacing(9) - 1,
             },
         },

[Survived] ObjectLiteral
Frontier/src/utils/initialTheme.ts:62:18
             padding: theme.spacing(0, 1),
             ...theme.mixins.toolbar,
         },
-        content: {
-            flexGrow: 1,
-            marginTop: '64px',
-            padding: theme.spacing(3),
-        },
+        content: {},
     }),
 );

[Survived] StringLiteral
Frontier/src/utils/initialTheme.ts:64:24
         },
         content: {
             flexGrow: 1,
-            marginTop: '64px',
+            marginTop: "",
             padding: theme.spacing(3),
         },
