[Survived] StringLiteral
Frontier/src/utils/localizationMaterialTable.ts:4:28
 export const localizationMaterialTable = {
     toolbar: {
         nRowsSelected: '{0} строк(и) выбраны',
-        searchPlaceholder: 'Поиск',
+        searchPlaceholder: "",
     },
     header: {

[Survived] ObjectLiteral
Frontier/src/utils/localizationMaterialTable.ts:6:13
         nRowsSelected: '{0} строк(и) выбраны',
         searchPlaceholder: 'Поиск',
     },
-    header: {
-        actions: 'Действия',
-    },
+    header: {},
     body: {
         addTooltip: 'Добавить',

[Survived] StringLiteral
Frontier/src/utils/localizationMaterialTable.ts:7:18
         searchPlaceholder: 'Поиск',
     },
     header: {
-        actions: 'Действия',
+        actions: "",
     },
     body: {

[Survived] ObjectLiteral
Frontier/src/utils/localizationMaterialTable.ts:9:11
     header: {
         actions: 'Действия',
     },
-    body: {
-        addTooltip: 'Добавить',
-        deleteTooltip: 'Удалить',
-        editTooltip: 'Редактировать',
-        emptyDataSourceMessage: 'Посетителей нет',
-        filterRow: {
-            filterTooltip: 'Фильтр',
-        },
-        editRow: {
-            deleteText: 'Вы уверены, что хотите удалить эту строку?',
-            cancelTooltip: 'Отмени',
-            saveTooltip: 'Сохранить',
-        },
-    },
+    body: {},
     pagination: {
         labelRowsSelect: 'Строк',

[Survived] StringLiteral
Frontier/src/utils/localizationMaterialTable.ts:13:33
         addTooltip: 'Добавить',
         deleteTooltip: 'Удалить',
         editTooltip: 'Редактировать',
-        emptyDataSourceMessage: 'Посетителей нет',
+        emptyDataSourceMessage: "",
         filterRow: {
             filterTooltip: 'Фильтр',

[Survived] StringLiteral
Frontier/src/utils/localizationMaterialTable.ts:15:28
         editTooltip: 'Редактировать',
         emptyDataSourceMessage: 'Посетителей нет',
         filterRow: {
-            filterTooltip: 'Фильтр',
+            filterTooltip: "",
         },
         editRow: {

[Survived] ObjectLiteral
Frontier/src/utils/localizationMaterialTable.ts:17:18
         filterRow: {
             filterTooltip: 'Фильтр',
         },
-        editRow: {
-            deleteText: 'Вы уверены, что хотите удалить эту строку?',
-            cancelTooltip: 'Отмени',
-            saveTooltip: 'Сохранить',
-        },
+        editRow: {},
     },
     pagination: {

[Survived] StringLiteral
Frontier/src/utils/localizationMaterialTable.ts:20:26
         editRow: {
             deleteText: 'Вы уверены, что хотите удалить эту строку?',
             cancelTooltip: 'Отмени',
-            saveTooltip: 'Сохранить',
+            saveTooltip: "",
         },
     },

[Survived] ObjectLiteral
Frontier/src/utils/localizationMaterialTable.ts:23:17
             saveTooltip: 'Сохранить',
         },
     },
-    pagination: {
-        labelRowsSelect: 'Строк',
-    },
+    pagination: {},
 };
 
