[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:16:22
     data: Array<Visitor>,
     startDate: number,
     endDate: number,
-): Array<Visitor> => {
-    return data.filter((item) => {
-        const lastTimestamp = item.times[item.times.length - 1].timestamp;
-        return startDate <= lastTimestamp && lastTimestamp <= endDate;
-    });
-};
+): Array<Visitor> => {};
 
 export const sortData = (data: Array<Visitor>): SortedData => {

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:17:34
     startDate: number,
     endDate: number,
 ): Array<Visitor> => {
-    return data.filter((item) => {
-        const lastTimestamp = item.times[item.times.length - 1].timestamp;
-        return startDate <= lastTimestamp && lastTimestamp <= endDate;
-    });
+    return data.filter((item) => {});
 };
 

[Survived] ArithmeticOperator
Frontier/src/utils/statisticsUtils.ts:18:60
     endDate: number,
 ): Array<Visitor> => {
     return data.filter((item) => {
-        const lastTimestamp = item.times[item.times.length - 1].timestamp;
+        const lastTimestamp = item.times[item.times.length + 1].timestamp;
         return startDate <= lastTimestamp && lastTimestamp <= endDate;
     });

[Survived] EqualityOperator
Frontier/src/utils/statisticsUtils.ts:19:60
 ): Array<Visitor> => {
     return data.filter((item) => {
         const lastTimestamp = item.times[item.times.length - 1].timestamp;
-        return startDate <= lastTimestamp && lastTimestamp <= endDate;
+        return startDate <= lastTimestamp && lastTimestamp < endDate;
     });
 };

[Survived] EqualityOperator
Frontier/src/utils/statisticsUtils.ts:19:26
 ): Array<Visitor> => {
     return data.filter((item) => {
         const lastTimestamp = item.times[item.times.length - 1].timestamp;
-        return startDate <= lastTimestamp && lastTimestamp <= endDate;
+        return startDate < lastTimestamp && lastTimestamp <= endDate;
     });
 };

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:23:63
     });
 };
 
-export const sortData = (data: Array<Visitor>): SortedData => {
-    return data.reduce((sortedData: SortedData, visitor: Visitor) => {
-        const lastTimestamp = timestampToString(visitor.times[visitor.times.length - 1].timestamp);
-        if (sortedData[lastTimestamp] !== undefined) {
-            sortedData[lastTimestamp].push(visitor);
-        } else {
-            sortedData[lastTimestamp] = [visitor];
-        }
-        return sortedData;
-    }, {});
-};
+export const sortData = (data: Array<Visitor>): SortedData => {};
 
 export const calculateTotalStatistics = (

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:24:70
 };
 
 export const sortData = (data: Array<Visitor>): SortedData => {
-    return data.reduce((sortedData: SortedData, visitor: Visitor) => {
-        const lastTimestamp = timestampToString(visitor.times[visitor.times.length - 1].timestamp);
-        if (sortedData[lastTimestamp] !== undefined) {
-            sortedData[lastTimestamp].push(visitor);
-        } else {
-            sortedData[lastTimestamp] = [visitor];
-        }
-        return sortedData;
-    }, {});
+    return data.reduce((sortedData: SortedData, visitor: Visitor) => {}, {});
 };
 

[Survived] ArithmeticOperator
Frontier/src/utils/statisticsUtils.ts:25:84
 
 export const sortData = (data: Array<Visitor>): SortedData => {
     return data.reduce((sortedData: SortedData, visitor: Visitor) => {
-        const lastTimestamp = timestampToString(visitor.times[visitor.times.length - 1].timestamp);
+        const lastTimestamp = timestampToString(visitor.times[visitor.times.length + 1].timestamp);
         if (sortedData[lastTimestamp] !== undefined) {
             sortedData[lastTimestamp].push(visitor);

[Survived] EqualityOperator
Frontier/src/utils/statisticsUtils.ts:26:39
 export const sortData = (data: Array<Visitor>): SortedData => {
     return data.reduce((sortedData: SortedData, visitor: Visitor) => {
         const lastTimestamp = timestampToString(visitor.times[visitor.times.length - 1].timestamp);
-        if (sortedData[lastTimestamp] !== undefined) {
+        if (sortedData[lastTimestamp] === undefined) {
             sortedData[lastTimestamp].push(visitor);
         } else {

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:26:54
 export const sortData = (data: Array<Visitor>): SortedData => {
     return data.reduce((sortedData: SortedData, visitor: Visitor) => {
         const lastTimestamp = timestampToString(visitor.times[visitor.times.length - 1].timestamp);
-        if (sortedData[lastTimestamp] !== undefined) {
-            sortedData[lastTimestamp].push(visitor);
-        } else {
+        if (sortedData[lastTimestamp] !== undefined) {} else {
             sortedData[lastTimestamp] = [visitor];
         }

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:28:16
         const lastTimestamp = timestampToString(visitor.times[visitor.times.length - 1].timestamp);
         if (sortedData[lastTimestamp] !== undefined) {
             sortedData[lastTimestamp].push(visitor);
-        } else {
-            sortedData[lastTimestamp] = [visitor];
-        }
+        } else {}
         return sortedData;
     }, {});

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:38:29
 export const calculateTotalStatistics = (
     data: SortedData,
     tariffs: Array<Tariff>,
-): Array<StatisticsData> => {
-    return Object.keys(data).map((key: string) => {
-        const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + calculateCostHelper(visitor, tariffs);
-        }, 0);
-        return { title: key, value: total };
-    });
-};
+): Array<StatisticsData> => {};
 export const calculateAverageCostStatistics = (
     data: SortedData,

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:39:51
     data: SortedData,
     tariffs: Array<Tariff>,
 ): Array<StatisticsData> => {
-    return Object.keys(data).map((key: string) => {
-        const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + calculateCostHelper(visitor, tariffs);
-        }, 0);
-        return { title: key, value: total };
-    });
+    return Object.keys(data).map((key: string) => {});
 };
 export const calculateAverageCostStatistics = (

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:40:78
     tariffs: Array<Tariff>,
 ): Array<StatisticsData> => {
     return Object.keys(data).map((key: string) => {
-        const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + calculateCostHelper(visitor, tariffs);
-        }, 0);
+        const total = data[key].reduce((result: number, visitor: Visitor) => {}, 0);
         return { title: key, value: total };
     });

[Survived] ArithmeticOperator
Frontier/src/utils/statisticsUtils.ts:41:27
 ): Array<StatisticsData> => {
     return Object.keys(data).map((key: string) => {
         const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + calculateCostHelper(visitor, tariffs);
+            return result - calculateCostHelper(visitor, tariffs);
         }, 0);
         return { title: key, value: total };

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:49:29
 export const calculateAverageCostStatistics = (
     data: SortedData,
     tariffs: Array<Tariff>,
-): Array<StatisticsData> => {
-    const total = calculateTotalStatistics(data, tariffs);
-    return total.map((item) => ({
-        title: item.title,
-        value: Math.round(item.value / data[item.title].length),
-    }));
-};
+): Array<StatisticsData> => {};
 export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {
     return Object.keys(data).map((key: string) => {

[Survived] ArrowFunction
Frontier/src/utils/statisticsUtils.ts:51:22
     tariffs: Array<Tariff>,
 ): Array<StatisticsData> => {
     const total = calculateTotalStatistics(data, tariffs);
-    return total.map((item) => ({
-        title: item.title,
-        value: Math.round(item.value / data[item.title].length),
-    }));
+    return total.map(() => undefined);
 };
 export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {

[Survived] ArithmeticOperator
Frontier/src/utils/statisticsUtils.ts:53:38
     const total = calculateTotalStatistics(data, tariffs);
     return total.map((item) => ({
         title: item.title,
-        value: Math.round(item.value / data[item.title].length),
+        value: Math.round(item.value * data[item.title].length),
     }));
 };

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:56:96
         value: Math.round(item.value / data[item.title].length),
     }));
 };
-export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {
-    return Object.keys(data).map((key: string) => {
-        const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + Math.round(calculateDuration(visitor.times) / 60);
-        }, 0);
-        return { title: key, value: Math.round(total / data[key].length) };
-    });
-};
+export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {};
 export const calculateQuantityVisitorsStatistics = (data: SortedData): Array<StatisticsData> => {
     return Object.keys(data).map((key: string) => {

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:57:51
     }));
 };
 export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {
-    return Object.keys(data).map((key: string) => {
-        const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + Math.round(calculateDuration(visitor.times) / 60);
-        }, 0);
-        return { title: key, value: Math.round(total / data[key].length) };
-    });
+    return Object.keys(data).map((key: string) => {});
 };
 export const calculateQuantityVisitorsStatistics = (data: SortedData): Array<StatisticsData> => {

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:58:78
 };
 export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {
     return Object.keys(data).map((key: string) => {
-        const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + Math.round(calculateDuration(visitor.times) / 60);
-        }, 0);
+        const total = data[key].reduce((result: number, visitor: Visitor) => {}, 0);
         return { title: key, value: Math.round(total / data[key].length) };
     });

[Survived] ArithmeticOperator
Frontier/src/utils/statisticsUtils.ts:59:73
 export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {
     return Object.keys(data).map((key: string) => {
         const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + Math.round(calculateDuration(visitor.times) / 60);
+            return result + Math.round(calculateDuration(visitor.times) * 60);
         }, 0);
         return { title: key, value: Math.round(total / data[key].length) };

[Survived] ArithmeticOperator
Frontier/src/utils/statisticsUtils.ts:59:27
 export const calculateAverageDurationStatistics = (data: SortedData): Array<StatisticsData> => {
     return Object.keys(data).map((key: string) => {
         const total = data[key].reduce((result: number, visitor: Visitor) => {
-            return result + Math.round(calculateDuration(visitor.times) / 60);
+            return result - Math.round(calculateDuration(visitor.times) / 60);
         }, 0);
         return { title: key, value: Math.round(total / data[key].length) };

[Survived] ArithmeticOperator
Frontier/src/utils/statisticsUtils.ts:61:54
         const total = data[key].reduce((result: number, visitor: Visitor) => {
             return result + Math.round(calculateDuration(visitor.times) / 60);
         }, 0);
-        return { title: key, value: Math.round(total / data[key].length) };
+        return { title: key, value: Math.round(total * data[key].length) };
     });
 };

[Survived] ObjectLiteral
Frontier/src/utils/statisticsUtils.ts:61:16
         const total = data[key].reduce((result: number, visitor: Visitor) => {
             return result + Math.round(calculateDuration(visitor.times) / 60);
         }, 0);
-        return { title: key, value: Math.round(total / data[key].length) };
+        return {};
     });
 };

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:64:97
         return { title: key, value: Math.round(total / data[key].length) };
     });
 };
-export const calculateQuantityVisitorsStatistics = (data: SortedData): Array<StatisticsData> => {
-    return Object.keys(data).map((key: string) => {
-        const total = data[key].length;
-        return { title: key, value: total };
-    });
-};
+export const calculateQuantityVisitorsStatistics = (data: SortedData): Array<StatisticsData> => {};
 

[Survived] BlockStatement
Frontier/src/utils/statisticsUtils.ts:65:51
     });
 };
 export const calculateQuantityVisitorsStatistics = (data: SortedData): Array<StatisticsData> => {
-    return Object.keys(data).map((key: string) => {
-        const total = data[key].length;
-        return { title: key, value: total };
-    });
+    return Object.keys(data).map((key: string) => {});
 };
 
