[Timeout] ObjectLiteral
frontier/Frontier/src/store.ts:44:32
     return configureStore({
         reducer: persistedReducer,
         middleware: getDefaultMiddleware({
-            serializableCheck: {
-                ignoredActions: [FLUSH, REHYDRATE, PAUSE, PERSIST, PURGE, REGISTER],
-            },
+            serializableCheck: {},
         }),
         devTools: process.env.NODE_ENV !== 'production',

[Timeout] ConditionalExpression
frontier/Frontier/src/store.ts:48:19
                 ignoredActions: [FLUSH, REHYDRATE, PAUSE, PERSIST, PURGE, REGISTER],
             },
         }),
-        devTools: process.env.NODE_ENV !== 'production',
+        devTools: false,
     });
 };
