[Killed] ArrowFunction
Frontier/src/utils/calculateCostHelper.ts:10:45
     let total = 0;
     for (let i = 0; i < data.length; i++) {
         const tariffId = +data[i].tariffId;
-        const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
+        const tariffMaxCost = (tariffs.find(() => undefined) as Tariff).maxCost;
         const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)

[Killed] ConditionalExpression
Frontier/src/utils/calculateCostHelper.ts:11:54
     for (let i = 0; i < data.length; i++) {
         const tariffId = +data[i].tariffId;
         const tariffMaxCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).maxCost;
-        const tariffCost = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff).cost;
+        const tariffCost = (tariffs.find((tariff) => false) as Tariff).cost;
         const tariffIsDuration = (tariffs.find((tariff) => tariff.id === tariffId) as Tariff)
             .isDuration;
