[Killed] ConditionalExpression
Frontier/src/utils/calculateDuration.ts:10:13
         if (times[i].status === Status.active) {
             startMark = times[i].timestamp;
         } else {
-            time += times[i].timestamp - startMark;
+            false;
             startMark = 0;
         }
